In [1]:
# Look at the data
import pandas as pd
df = pd.read_csv('advisorsmith_cost_of_living_index.csv')
df.head()

         City State  Cost of Living Index
0     Abilene    TX                  89.1
1      Adrian    MI                  90.5
2       Akron    OH                  89.4
3  Alamogordo    NM                  85.8
4      Albany    GA                  87.3

In [2]:
df.tail()

           City State  Cost of Living Index
505    Wheeling    WV                  84.1
506  New London    CT                 105.9
507      Daphne    AL                  96.6
508    Victoria    TX                  89.5
509    Aberdeen    WA                  97.6

In [3]:
df.shape

(510, 3)

In [4]:
# Check for null values
df.isnull().sum()

City                    0
State                   0
Cost of Living Index    0
dtype: int64

In [5]:
# Check for duplicates
df[df.duplicated(keep=False)]

Empty DataFrame
Columns: [City, State, Cost of Living Index]
Index: []

In [6]:
df_sorted = df.sort_values(['State'])
df_sorted.head()

           City State  Cost of Living Index
133   Fairbanks    AK                 107.9
14    Anchorage    AK                 110.7
190  Huntsville    AL                  91.3
113      Dothan    AL                  86.3
44   Birmingham    AL                  90.7

In [7]:
df_sorted.reset_index(drop=True)

           City State  Cost of Living Index
0     Fairbanks    AK                 107.9
1     Anchorage    AK                 110.7
2    Huntsville    AL                  91.3
3        Dothan    AL                  86.3
4    Birmingham    AL                  90.7
..          ...   ...                   ...
505  Charleston    WV                  83.9
506  Huntington    WV                  84.3
507  Morgantown    WV                  88.5
508    Cheyenne    WY                  96.9
509      Casper    WY                  94.2

[510 rows x 3 columns]

In [8]:
df_sorted.to_csv('cost_of_living.csv', index=False)

In [9]:
# Put the dataset inside AWS RDS
from sqlalchemy import create_engine
engine = create_engine('postgresql://dell4:6hB1iSYrtR@db-cityspire-samir.c2uishzxxikl.us-east-1.rds.amazonaws.com:5432/cityspire')
df_sorted.to_sql('cost_of_living', engine, index=False)